
console.log ('Выведите числа от 1 до 50 и от 50 до 1');

let i = 1;

while (i <= 50) {
    i++;
    console.log (i);
}

console.log ('---------------------');

i = 50;

while (i >= 1) {
    i--;
    console.log (i);
}

console.log ('---------------------');

for (let i = 1; i <= 50; i++) {
    console.log (i);
}

console.log ('---------------------');

for (let i = 50; i >=1; i--) {
    console.log (i);
}

//--------------------------------------------------------------

console.log ('Необходимо вывести на экран числа от 50 до 1 с шагом 2, 5 и 10. Решитезадачу двумя циклами.');

i = 50;
while (i >= 1) {
  console.log(i);
  i -= 2;
}

for (let i = 50; i >= 1; i -=2) {
    console.log(i);
}

console.log ('---------------------');

i = 50;
while (i >= 1) {
  console.log(i);
  i -= 5;
}

for (let i = 50; i >= 1; i -=5) {
    console.log(i);
}

console.log ('---------------------');

i = 50;
while (i >= 1) {
  console.log(i);
  i -= 10;
}

for (let i = 50; i >= 1; i -=10) {
    console.log(i);
}
//--------------------------------------------------------------

console.log ('Выведите столбец чисел от 89 до 11 - воспользуйтесь циклом while и отделите числа тегом br друг от друга, чтобы получить столбец, а не строку');

i = 89;

while ( i >= 11) {
    document.write(i + "<br/>");
    i--;
}

//--------------------------------------------------------------

console.log ('Найдите сумму чисел от 1 до 50, а также сумму этих же чисел, исключая четные.');

let sumAll = 0;
let sumEven = 0;

for (let i = 1; i <= 50; i++) {
  sumAll += i;
  if (i % 2 != 0) {
    sumEven += i;
  } continue;
}

console.log (sumAll);
console.log (sumEven);

//--------------------------------------------------------------

console.log ('С помощью цикла найдите сумму чисел от 0 до 100');

let a = 100;
let sum = 0;

for (let i = 0; i <=a; i++) {
    console.log (i);
    sum += i;
}

console.log (sum);

//--------------------------------------------------------------

console.log ('Найдите сумму чисел в каждом числе от 1 до 5, например: в числе 3 сумма составляет 6 (1+2+3)');

a = 5;

for (let i = 1; i <= a; i++) {
    sum = 0;

    for (let j = 1; j <= i; j++) {
        sum += j;
    }

    console.log ('Sum ' + i + ' = ' + sum);
}


//--------------------------------------------------------------

console.log ('Выведите чётные числа от 8 до 56. Решить задание через while и for');

i = 7;

while (i <= 56) {
    i++;
    if(i % 2 != 0) continue;

    console.log (i);
}

console.log ('---------------------');

for (let i = 8; i <= 56; i++) {
    if(i % 2 != 0) continue;

    console.log (i);
}

//--------------------------------------------------------------

console.log ('Необходимо вывести на экран полную таблицу умножения (от 2 до 10)');

let b = 1;

for (let a = 2; a <= 10; b++) {

    c = a * b; 
    console.log (`${a} * ${b} = ${c}`);

    if (b > 10) {
        a++;
        b = 1;
    }
}

//--------------------------------------------------------------

console.log ('Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.');

let n = 1000;
let num = 0;

while (n >= 50) {
    n /= 2;
    num++;

    console.log (n);
}

    console.log (num);

//--------------------------------------------------------------

console.log ('Напишите программу, где пользователь вводит любое целое положительное число. А программа суммирует все числа от 1 до введенного пользователемчисла.')

a = prompt('введите любое целое положительное число');
n = Number(a);
num = 0;

for ( let i = 1; i <= n; i++) {
    num += i;
    console.log (num);
}

//--------------------------------------------------------------

console.log ('Написать с помощью цикла while «переворот» числа')

let str = '12345';
let str2 = ''
for ( let i = 10; i >= 0; i--) { 
    if (str[i] == undefined);
    console.log(str[i]);
}

//--------------------------------------------------------------
console.log('Вычислить сумму первой и последней цифр целого числа')

let strNum = '12345',
    frtNum = +strNum[0],
    lastNum;

for (let i = 0; strNum != strNum.length; i++) {
    if (strNum[i] == strNum.length) {
        lastNum = +strNum[i];
        break;
    }
}

console.log(frtNum + lastNum);

//--------------------------------------------------------------

console.log ('Посчитайте и выведете кол-во встречающихся чисел в строке')

let text = 'В 1996 году компания Microsoft выпустила аналог языка JavaScript, названный JScript. Анонсирован этот язык был 18 июля 1996 года[29]. Первым браузером, поддерживающим эту реализацию, был Internet Explorer 3.0.';
let count = 0;

for ( let i = 0; i < text.length; i++) { 

    if (isNaN(parseInt(text[i])))continue;
    if (+text[i] >= 0 && text[i] <= 9) count++;
    
    console.log(count) 
}

//--------------------------------------------------------------

console.log ('Нарисуйте в консоле браузера прямоугольный треугольник заполненный символом #.')

let height = 5;

for (let i = 1; i <= height; i++) {
    console.log('#'.repeat(i));
}

//--------------------------------------------------------------

console.log ('Нарисуйте в консоле браузера прямоугольный треугольник заполненный символом #.')

num = "7646546546564";
count = 0;

for (let i = 0; str[i] != undefined; i++) {
    if (+str[i] == 5) count++;

    console.log(count);
}